### What is pandas?
Pandas is a powerful Python library that is specifically designed to work on data frames that have "relational" or "labeled" data.<br>
Works well for data manipulation, operating a dataset, exploring a data frame, data analysis, and machine learning-related tasks.<br>

### Why Pandas?
* **Import datasets -** available in the form of spreadsheets, comma-separated values (CSV) files, and more.
* **Data cleansing -** dealing with missing values and representing them as NaN, NA, or NaT.
* **Size mutability -** columns can be added and removed from DataFrame and higher-dimensional objects.
* **Data normalization –** normalize the data into a suitable format for analysis.
* **Data alignment -** objects can be explicitly aligned to a set of labels.
* **Intuitive merging and joining data sets –** we can merge and join datasets.
* **Reshaping and pivoting of datasets –** datasets can be reshaped and pivoted as per the need.
* **Efficient manipulation and extraction -** manipulation and extraction of specific parts of extensive datasets using intelligent label-based slicing, indexing, and subsetting techniques.
* **Statistical analysis -** to perform statistical operations on datasets.
* **Data visualization -** Visualize datasets and uncover insights.

In [2]:
! pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd
import numpy as np

### Python Pandas Data Structures
Data structures in Pandas are designed to handle data efficiently. <br>
They allow for the organization, storage, and modification of data in a way that optimizes memory usage and computational performance. <br>
Python Pandas library provides two primary data structures for handling and analyzing data<br>
* **Series -** A one-dimensional labeled array, sizeimmutable.
* **DataFrame -** A two-dimensional labeled, size-mutable tabular structure.

#### Series
A Series is a one-dimensional labeled array that can hold any data type. <br>
It can store integers, strings, floating-point numbers, etc. <br>
Each value in a Series is associated with a label (index), which can be an integer or a string.

In [150]:
import pandas as pd

data = ['Steve', 35, 'Male', '3.5']
series = pd.Series(data, index=['Name', 'Age', 'Gender', 'Rating'])
print(series)

Name      Steve
Age          35
Gender     Male
Rating      3.5
dtype: object

In [152]:
series.shape

(4,)

#### DataFrame
A DataFrame is a two-dimensional labeled data structure with columns that can hold different data types. <br>
It is similar to a table in a database or a spreadsheet.

In [154]:

# Data represented as a dictionary
data = {
    'Name': ['Steve', 'Lia', 'Vin', 'Katie'],
    'Age': [32, 28, 45, 38],
    'Gender': ['Male', 'Female', 'Male', 'Female'],
    'Rating': [3.45, 4.6, 3.9, 2.78]
}

# Creating the DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
print(df)

    Name  Age  Gender  Rating
0  Steve   32    Male    3.45
1    Lia   28  Female    4.60
2    Vin   45    Male    3.90
3  Katie   38  Female    2.78

In [156]:
df["Name"]

0    Steve
1      Lia
2      Vin
3    Katie
Name: Name, dtype: object

### Pandas - Index Objects
In Pandas, Index Objects play an important role in organizing and accessing data in a structured way. <br>
They work like labeled arrays and play an important role in defining how data is arranged and accessed in structures like Series and DataFrames. <br>
The Index allows quick data searches, efficient slicing, and keeps data properly aligned, while giving each row meaningful labels.

An Index is used to label the rows of a DataFrame or elements in a Series. <br>
These labels can be numbers, strings, or dates, and they help you to identify the data. <br>

#### Types of Indexes in Pandas
* **NumericIndex**
* **CategoricalIndex**
* **MultiIndex**
* **IntervalIndex**
* **DatetimeIndex**
* **TimedeltaIndex**
* **PeriodIndex**

In [160]:
import pandas as pd

# Generate some data for DataFrame
data = {
   'Name': ['Steve', 'Lia', 'Vin', 'Katie'],
   'Age': [32, 28, 45, 38],
   'Gender': ['Male', 'Female', 'Male', 'Female'],
   'Rating': [3.45, 4.6, 3.9, 2.78]
}
# Creating the DataFrame
df = pd.DataFrame(data)
df

    Name  Age  Gender  Rating
0  Steve   32    Male    3.45
1    Lia   28  Female    4.60
2    Vin   45    Male    3.90
3  Katie   38  Female    2.78

In [162]:

# Display the DataFrame

print("\nDataFrame Index Object Type:",df.index.dtype)

DataFrame Index Object Type: int64

In [164]:
import pandas as pd

# Creating a CategoricalIndex
categories = pd.CategoricalIndex(['a','b', 'a', 'c'])
df = pd.DataFrame({'Col1': [50, 70, 90, 60], 'Col2':[1, 3, 5, 8]}, index=categories)
print("Input DataFrame:\n",df)

print("\nDataFrame Index Object Type:",df.index.dtype)

Input DataFrame:
    Col1  Col2
a    50     1
b    70     3
a    90     5
c    60     8

DataFrame Index Object Type: category

In [166]:
import pandas as pd

# Creating a IntervalIndex
interval_idx = pd.interval_range(start=0, end=4)

# Creating a DataFrame with IntervalIndex
df = pd.DataFrame({'Col1': [1, 2, 3, 4], 'Col2':[1, 3, 5, 8]}, index=interval_idx)

print("Input DataFrame:\n",df)

print("\nDataFrame Index Object Type:",df.index.dtype)

Input DataFrame:
         Col1  Col2
(0, 1]     1     1
(1, 2]     2     3
(2, 3]     3     5
(3, 4]     4     8

DataFrame Index Object Type: interval[int64, right]

In [14]:
import pandas as pd

# Create MultiIndex
arrays = [[1, 1, 2, 2], ['red', 'blue', 'red', 'blue']]
multi_idx = pd.MultiIndex.from_arrays(arrays, names=('number', 'color'))

# Create a DataFrame with MultiIndex
df = pd.DataFrame({'Col1': [1, 2, 3, 4], 'Col2':[1, 3, 5, 8]}, index=multi_idx)

print("MultiIndexed DataFrame:\n",df)

MultiIndexed DataFrame:
               Col1  Col2
number color
1      red       1     1
       blue      2     3
2      red       3     5
       blue      4     8

In [15]:
import pandas as pd

# Create DatetimeIndex
datetime_idx = pd.DatetimeIndex(["2020-01-01 10:00:00", "2020-02-01 11:00:00"])

# Create a DataFrame with DatetimeIndex
df = pd.DataFrame({'Col1': [1, 2], 'Col2':[1, 3]}, index=datetime_idx )

print("DatetimeIndexed DataFrame:\n",df)

DatetimeIndexed DataFrame:
                      Col1  Col2
2020-01-01 10:00:00     1     1
2020-02-01 11:00:00     2     3

In [16]:
import pandas as pd

# Create TimedeltaIndex
timedelta_idx = pd.TimedeltaIndex(['0 days', '1 days', '2 days'])

# Create a DataFrame with TimedeltaIndex
df = pd.DataFrame({'Col1': [1, 2, 3], 'Col2':[1, 3, 3]}, index=timedelta_idx )

print("TimedeltaIndexed DataFrame:\n",df)

TimedeltaIndexed DataFrame:
         Col1  Col2
0 days     1     1
1 days     2     3
2 days     3     3

In [17]:
import pandas as pd

# Create PeriodIndex
period_idx = pd.PeriodIndex(year=[2020, 2024], quarter=[1, 3])

# Create a DataFrame with PeriodIndex
df = pd.DataFrame({'Col1': [1, 2], 'Col2':[1, 3]}, index=period_idx )

print("PeriodIndexed DataFrame:\n",df)

PeriodIndexed DataFrame:
         Col1  Col2
2020Q1     1     1
2024Q3     2     3

C:\Users\jlakh\AppData\Local\Temp\ipykernel_14332\4116988125.py:4: FutureWarning: Constructing PeriodIndex from fields is deprecated. Use PeriodIndex.from_fields instead.
  period_idx = pd.PeriodIndex(year=[2020, 2024], quarter=[1, 3])

### Pandas - Basic Functionality
#### Attributes in Pandas
* **dtype -** Returns the data type of the elements in the Series or DataFrame.
* **index -** Provides the index (row labels) of the Series or DataFrame.
* **values -** Returns the data in the Series or DataFrame as a NumPy array.
* **shape -** Returns a tuple representing the dimensionality of the DataFrame (rows, columns).
* **ndim -** Returns the number of dimensions of the object. Series is always 1D, and DataFrame is 2D.
* **size -** Gives the total number of elements in the object.
* **empty -** Checks if the object is empty, and returns True if it is.
* **columns -** Provides the column labels of the DataFrame object.

In [168]:
import pandas as pd

# Data represented as a dictionary
data = {
    'Name': ['Steve', 'Lia', 'Vin', 'Katie'],
    'Age': [32, 28, 45, 38],
    'Gender': ['Male', 'Female', 'Male', 'Female'],
    'Rating': [3.45, 4.6, 3.9, 2.78]
}

# Creating the DataFrame
df = pd.DataFrame(data)

df

    Name  Age  Gender  Rating
0  Steve   32    Male    3.45
1    Lia   28  Female    4.60
2    Vin   45    Male    3.90
3  Katie   38  Female    2.78

In [170]:
print(df["Age"].dtype)

int64

In [174]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [176]:
df.values

array([['Steve', 32, 'Male', 3.45],
       ['Lia', 28, 'Female', 4.6],
       ['Vin', 45, 'Male', 3.9],
       ['Katie', 38, 'Female', 2.78]], dtype=object)

In [178]:
df.shape

(4, 4)

In [180]:
df.ndim

2

In [182]:
df.size

16

In [26]:
df.empty

False

#### Basic Methods in Pandas
* **head(n) -** Returns the first n rows of the object. The default value of n is 5.
* **tail(n) -** Returns the last n rows of the object. The default value of n is 5.
* **info() -** Provides a concise summary of a DataFrame, including the index dtype and column dtypes, non-null values, and memory usage.
* **describe() -** Generates descriptive statistics of the DataFrame or Series, such as count, mean, std, min, and max.

In [184]:
df

    Name  Age  Gender  Rating
0  Steve   32    Male    3.45
1    Lia   28  Female    4.60
2    Vin   45    Male    3.90
3  Katie   38  Female    2.78

In [186]:
df.head(3)

    Name  Age  Gender  Rating
0  Steve   32    Male    3.45
1    Lia   28  Female    4.60
2    Vin   45    Male    3.90

In [188]:
df.tail(2)

    Name  Age  Gender  Rating
2    Vin   45    Male    3.90
3  Katie   38  Female    2.78

In [190]:
df.describe()

             Age    Rating
count   4.000000  4.000000
mean   35.750000  3.682500
std     7.410578  0.765436
min    28.000000  2.780000
25%    31.000000  3.282500
50%    35.000000  3.675000
75%    39.750000  4.075000
max    45.000000  4.600000

### Indexing and Selecting Data
* **Label-Based Indexing with .loc**
* **Integer Position-Based Indexing with .iloc**
* **Indexing with Brackets []**

#### Label-Based Indexing with .loc

The .loc indexer is used for label-based indexing, which means you can access rows and columns by their labels. <br>
It also supports boolean arrays for conditional selection.<br>

.loc() has multiple access methods like −
* **single scalar label:** Selects a single row or column, e.g., df.loc['a'].
* **list of labels:** Select multiple rows or columns, e.g., df.loc[['a', 'b']].
* **Label Slicing:** Use slices with labels, e.g., df.loc['a':'f'] (both start and end are included).
* **Boolean Arrays:** Filter data based on conditions, e.g., df.loc[boolean_array].

In [209]:
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [211]:
df.loc['b']

one    2.0
two    2.0
Name: b, dtype: float64

In [213]:
df.loc['a':'c']

   one  two
a  1.0    1
b  2.0    2
c  3.0    3

In [217]:
df.loc['a':'c', "one"]

a    1.0
b    2.0
c    3.0
Name: one, dtype: float64

In [221]:
df.loc['a':'c', ["one", "two"]]

   one  two
a  1.0    1
b  2.0    2
c  3.0    3

In [225]:
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [223]:
df["one"]>2

a    False
b    False
c     True
d    False
Name: one, dtype: bool

In [227]:
df.loc[df["one"]>2]

   one  two
c  3.0    3

#### Integer Position-Based Indexing with .iloc
The .iloc indexer is used for integer-based indexing, which allows you to select rows and columns by their numerical position. This method is similar to standard python and numpy indexing (i.e. 0-based indexing).

* **Single Integer:** Selects data by its position, e.g., df.iloc[0].
* **List of Integers:** Select multiple rows or columns by their positions, e.g., df.iloc[[0, 1, 2]].
* **Integer Slicing:** Use slices with integers, e.g., df.iloc[1:3].
* **Boolean Arrays:** Similar to .loc, but for positions.

In [229]:
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [237]:
df.iloc[3]

one    NaN
two    4.0
Name: d, dtype: float64

In [239]:
df.iloc[:3]

   one  two
a  1.0    1
b  2.0    2
c  3.0    3

In [241]:
df.iloc[0:2, 0:2]

   one  two
a  1.0    1
b  2.0    2

In [243]:
df.iloc[[1, 3], [1]]

   two
b    2
d    4

#### Direct Indexing with Brackets "[]"
Direct indexing with [] is a quick and intuitive way to access data, similar to indexing with Python dictionaries and NumPy arrays. <br>
It’s often used for basic operations −

* **Single Column:** Access a single column by its name.
* **Multiple Columns:** Select multiple columns by passing a list of column names.
* **Row Slicing:** Slice rows using integer-based indexing.

In [245]:
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [247]:
df['two']

a    1
b    2
c    3
d    4
Name: two, dtype: int64

In [249]:
df[['one', 'two']]

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

#### Creating DataFrame

In [192]:
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [194]:
df.empty

True

In [196]:
# Create a DataFrame from Lists
import pandas as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [202]:
# Create a DataFrame from Dict of ndarrays / Lists
import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky', "Rahul"],'Age':[28,34,29,42, 25]}
df = pd.DataFrame(data)
print(df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42
4  Rahul   25

In [204]:
# Create a DataFrame from List of Dicts
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
print(df)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [206]:
# Create a DataFrame from Dict of Series
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

### Modifying DataFrame
#### Renaming Column or Row Labels of a DataFrame

In [251]:
import pandas as pd

# Create a DataFrame
df = pd.DataFrame({'A': [1, 2, 3],'B': [4, 5, 6]})

# Display original DataFrame
print("Original DataFrame:")
print(df)

Original DataFrame:
   A  B
0  1  4
1  2  5
2  3  6

In [253]:
# Rename column 'A' to 'aa'
df = df.rename(columns={'A': 'aa'}, index={0: 'zero', 1: 'one'})

# Display modified DataFrame
print("Modified DataFrame:")
print(df)

Modified DataFrame:
      aa  B
zero   1  4
one    2  5
2      3  6

#### Adding or Inserting Columns

In [255]:
df

      aa  B
zero   1  4
one    2  5
2      3  6

In [257]:
df['C'] = [7, 8, 9]
df

      aa  B  C
zero   1  4  7
one    2  5  8
2      3  6  9

In [259]:
# Insert a new column 'D' at position 1
df.insert(1, 'D', [10, 11, 12])
df

      aa   D  B  C
zero   1  10  4  7
one    2  11  5  8
2      3  12  6  9

#### Replacing the Contents of a DataFrame

In [261]:
# Replace the contents of column 'aa' with new values
df['aa'] = [10, 20, 30]
df

      aa   D  B  C
zero  10  10  4  7
one   20  11  5  8
2     30  12  6  9

In [263]:
# Replace the contents 
df.replace({'aa': 10, 'B': 6}, 100, inplace=True)
df

       aa   D    B  C
zero  100  10    4  7
one    20  11    5  8
2      30  12  100  9

#### Deleting Columns

In [65]:
df

       aa   D    B  C
zero  100  10    4  7
one    20  11    5  8
2      30  12  100  9

In [265]:
# Delete columns 'aa' and 'B'
df = df.drop(columns=['aa', 'B'])
df

       D  C
zero  10  7
one   11  8
2     12  9

#### Removing Rows from a DataFrame

In [267]:
import pandas as pd

# Create a DataFrame
df = pd.DataFrame({'A': [1, 2, 3, 4, 5],'B': [4, 5, 6, 7, 8]})

# Display original DataFrame
print("Original DataFrame:")
print(df)

Original DataFrame:
   A  B
0  1  4
1  2  5
2  3  6
3  4  7
4  5  8

In [269]:
result = df.drop(3)
result

   A  B
0  1  4
1  2  5
2  3  6
4  5  8

In [271]:
# Drop the rows by row-labels
result = df.drop([1, 2])
result

   A  B
0  1  4
3  4  7
4  5  8

#### Removing Rows Based on a Conditions

In [275]:
# Create a DataFrame
df = pd.DataFrame({'A': [1, 2, 3, 4, 5],'B': [4, 5, 6, 7, 8],
'C': [90, 0, 11, 0, 13]}, index=['r1', 'r2', 'r3', 'r4', 'r5'])

# Display original DataFrame
print("Original DataFrame:")
print(df)

Original DataFrame:
    A  B   C
r1  1  4  90
r2  2  5   0
r3  3  6  11
r4  4  7   0
r5  5  8  13

In [277]:
df["C"]!=0

r1     True
r2    False
r3     True
r4    False
r5     True
Name: C, dtype: bool

In [279]:
result = df[df["C"] != 0]
result

    A  B   C
r1  1  4  90
r3  3  6  11
r5  5  8  13

#### Remove Rows using Index Slicing

In [281]:
# Create a DataFrame
df = pd.DataFrame({'A': [1, 2, 3, 4, 5],'B': [4, 5, 6, 7, 8]})

# Display original DataFrame
print("Original DataFrame:")
print(df)

Original DataFrame:
   A  B
0  1  4
1  2  5
2  3  6
3  4  7
4  5  8

In [76]:
# Drop the row using the index slicing
result = df.drop(df.index[2:4])
result

   A  B
0  1  4
1  2  5
4  5  8

### IO Tools

In [283]:
df

   A  B
0  1  4
1  2  5
2  3  6
3  4  7
4  5  8

In [285]:
df.to_csv("./data/sample_df.csv")

In [287]:
df.to_csv("./data/sample_df1.csv", index=False)

In [81]:
df1 = pd.read_csv("./data/sample_df1.csv", dtype={'A': np.float64})
df1

     A  B
0  1.0  4
1  2.0  5
2  3.0  6
3  4.0  7
4  5.0  8

In [291]:
df.to_json("./data/df_json.json")

In [303]:
df.to_json("./data/df_json_records.json", orient="records")

In [297]:
pd.read_csv("./data/sample_df1.csv")

   A  B
0  1  4
1  2  5
2  3  6
3  4  7
4  5  8

In [305]:
pd.read_json("./data/df_json_records.json")

   A  B
0  1  4
1  2  5
2  3  6
3  4  7
4  5  8

In [307]:
! pip install openpyxl

Requirement already satisfied: openpyxl in c:\programdata\anaconda3\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\programdata\anaconda3\lib\site-packages (from openpyxl) (1.1.0)

In [309]:
df.to_excel("./data/df.xlsx")

In [311]:
df = pd.read_excel('./data/df.xlsx') # , sheet_name="Sheet_2")

In [313]:
df

   Unnamed: 0  A  B
0           0  1  4
1           1  2  5
2           2  3  6
3           3  4  7
4           4  5  8

In [315]:
df1

     A  B
0  1.0  4
1  2.0  5
2  3.0  6
3  4.0  7
4  5.0  8

In [319]:
with pd.ExcelWriter('output_multiple_sheets.xlsx') as writer:
	df.to_excel(writer, sheet_name='Sheet_name_1')
	df1.to_excel(writer, sheet_name='Sheet_name_2')

### Pandas - Sorting
* **Sorting by Label −** This involves sorting the data based on the index labels.
* **Sorting by Value −** This involves sorting data based on the actual values in the DataFrame or Series.

#### Sorting by Label
To sort by the index labels, you can use the **sort_index() method**, <br>
by passing the axis arguments and the order of sorting, data structure object can be sorted. <br>
By default, this method sorts the DataFrame in ascending order based on the row labels.

In [500]:
import pandas as pd
import numpy as np

unsorted_df = pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns = ['col2','col1'])
unsorted_df

       col2      col1
1 -1.528820 -1.081294
4 -0.853780 -0.629229
6 -1.094288  0.991360
2 -0.661659 -0.448365
3 -1.404534  1.472940
5 -0.881638 -0.533097
9  0.969506 -1.173573
8  0.287146 -0.457540
0  0.991988 -0.289007
7  0.231411  1.018301

In [502]:
sorted_df = unsorted_df.sort_index()
sorted_df

       col2      col1
0  0.991988 -0.289007
1 -1.528820 -1.081294
2 -0.661659 -0.448365
3 -1.404534  1.472940
4 -0.853780 -0.629229
5 -0.881638 -0.533097
6 -1.094288  0.991360
7  0.231411  1.018301
8  0.287146 -0.457540
9  0.969506 -1.173573

In [504]:
sorted_df = unsorted_df.sort_index(ascending=False)
sorted_df

       col2      col1
9  0.969506 -1.173573
8  0.287146 -0.457540
7  0.231411  1.018301
6 -1.094288  0.991360
5 -0.881638 -0.533097
4 -0.853780 -0.629229
3 -1.404534  1.472940
2 -0.661659 -0.448365
1 -1.528820 -1.081294
0  0.991988 -0.289007

In [506]:

unsorted_df = pd.DataFrame(np.random.randn(6,4),index=[1,4,2,3,5,0],columns = ['col2','col1', 'col4', 'col3'])
unsorted_df

       col2      col1      col4      col3
1 -0.671152  1.311505  2.005524  1.437408
4 -0.867130 -0.425718  0.705654 -0.130798
2  0.801900 -0.358374 -0.017928  1.130382
3  0.313455  0.768144  1.615037 -0.882122
5  0.400363  0.698790  0.128410 -0.842293
0  0.996058  0.483026 -1.418429  0.064729

In [508]:
sorted_df = unsorted_df.sort_index(axis=1)
sorted_df

       col1      col2      col3      col4
1  1.311505 -0.671152  1.437408  2.005524
4 -0.425718 -0.867130 -0.130798  0.705654
2 -0.358374  0.801900  1.130382 -0.017928
3  0.768144  0.313455 -0.882122  1.615037
5  0.698790  0.400363 -0.842293  0.128410
0  0.483026  0.996058  0.064729 -1.418429

#### Sorting by Actual Values
Like index sorting, sorting by actual values can be done using the sort_values() method. <br>
This method allows sorting by one or more columns. <br>
It accepts a **'by' argument** which will use the column name of the DataFrame with which the values are to be sorted.

In [511]:
panda_series = pd.Series([18, 95, 66, 12, 55, 0])
panda_series

0    18
1    95
2    66
3    12
4    55
5     0
dtype: int64

In [513]:
panda_series_sorted = panda_series.sort_values(ascending=True)
panda_series_sorted

5     0
3    12
0    18
4    55
2    66
1    95
dtype: int64

In [515]:
unsorted_df = pd.DataFrame({'col1':[2,9,5,0],'col2':[1,3,2,4]})
unsorted_df

   col1  col2
0     2     1
1     9     3
2     5     2
3     0     4

In [517]:
sorted_df = unsorted_df.sort_values(by='col1')
sorted_df

   col1  col2
3     0     4
0     2     1
2     5     2
1     9     3

In [519]:
unsorted_df = pd.DataFrame({'col1':[2,1,0,1],'col2':[1,3,4,2]})
unsorted_df

   col1  col2
0     2     1
1     1     3
2     0     4
3     1     2

In [521]:
sorted_df = unsorted_df.sort_values(by=['col1','col2'])
sorted_df

   col1  col2
2     0     4
3     1     2
1     1     3
0     2     1

### Pandas - Reindexing
It allows you to align your data with a new set of labels. <br>
Whether you're working with rows or columns, reindexing gives you control over how your data aligns with the labels you specify.

This operation is useful when working with time series data, aligning datasets from different sources, or simply reorganizing data to match a particular structure.

### What is Reindexing?
Reindexing in Pandas refers to the process of conforming your data to match a new set of labels along a specified axis (rows or columns). <br>

This process can accomplish several tasks −
* **Reordering:** Reorder the existing data to match a new set of labels.
* **Inserting Missing Values:** If a label in the new set does not exist in the original data, Pandas will insert a missing value (NaN) for that label.
* **Filling Missing Data:** You can specify how to fill in missing values that result from reindexing, using various filling methods.

**Key Methods Used in Reindexing**
* **reindex():** This method is used to align an existing data structure with a new index (or columns). It can reorder and/or insert missing labels.

* **reindex_like():** This method allows you to reindex one DataFrame or Series to match another. It's useful when you want to ensure two data structures are aligned similarly.

* **Filling Methods:** When reindexing introduces NaN values, you can fill them using methods like ffill, bfill, and nearest.

In [524]:
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
s

a   -0.920834
b    1.692757
c    0.559842
d    0.850071
e   -0.972919
dtype: float64

In [526]:
s_reinds_reindexedexed = s.reindex(["e", "b", "f", "d"])
s_reinds_reindexedexed

e   -0.972919
b    1.692757
f         NaN
d    0.850071
dtype: float64

In [528]:
N=5

df = pd.DataFrame({
   'A': pd.date_range(start='2016-01-01',periods=N,freq='D'),
   'x': np.linspace(0,stop=N-1,num=N),
   'y': np.random.rand(N),
   'C': np.random.choice(['Low','Medium','High'],N).tolist(),
   'D': np.random.normal(100, 10, size=(N)).tolist()
})
df

           A    x         y       C           D
0 2016-01-01  0.0  0.224404    High   90.034223
1 2016-01-02  1.0  0.108643    High   97.640901
2 2016-01-03  2.0  0.144791     Low   72.428122
3 2016-01-04  3.0  0.403652    High   92.777155
4 2016-01-05  4.0  0.398750  Medium  100.135205

In [358]:
df_reindexed = df.reindex(index=[0,2,5], columns=['A', 'C', 'B'])
df_reindexed

           A       C   B
0 2016-01-01     Low NaN
2 2016-01-03  Medium NaN
5        NaT     NaN NaN

#### Reindex to Align with Other Objects
Sometimes, you may need to reindex one DataFrame to align it with another. <br>
The **reindex_like()** method allows you to do this seamlessly.

In [530]:
df1 = pd.DataFrame(np.random.randn(6, 3), columns=['col1', 'col2', 'col3'])
df1

       col1      col2      col3
0 -1.613597 -1.012503 -0.592755
1 -0.165408  0.635221 -0.608412
2 -0.495530  0.793926 -1.412982
3  1.204332 -0.338189 -1.198964
4 -0.119703  0.559130 -1.375864
5  0.515792  1.410894 -2.437768

In [532]:
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['col1', 'col2', 'col3'])
df2

       col1      col2      col3
0 -0.606207 -2.756435 -0.423135
1 -1.312495  1.366280  0.359363

In [368]:
df2.reindex_like(df1)

       col1      col2      col3
0  2.038173 -0.448680 -2.283087
1 -1.622021  0.500116 -0.723436
2       NaN       NaN       NaN
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN

#### Filling While ReIndexing
The **reindex()** method provides an optional parameter method for filling missing values. <br>

The available methods include −
* **pad/ffill:** Fill values forward.
* **bfill/backfill:** Fill values backward.
* **nearest:** Fill from the nearest index values.

In [534]:
df2

       col1      col2      col3
0 -0.606207 -2.756435 -0.423135
1 -1.312495  1.366280  0.359363

In [536]:
df2.reindex_like(df1, method='ffill')

       col1      col2      col3
0 -0.606207 -2.756435 -0.423135
1 -1.312495  1.366280  0.359363
2 -1.312495  1.366280  0.359363
3 -1.312495  1.366280  0.359363
4 -1.312495  1.366280  0.359363
5 -1.312495  1.366280  0.359363

#### Limits on Filling While Reindexing
The limit argument provides additional control over filling while reindexing. <br>
The limit specifies the maximum count of consecutive matches.

In [538]:
df2.reindex_like(df1, method='ffill', limit=1)

       col1      col2      col3
0 -0.606207 -2.756435 -0.423135
1 -1.312495  1.366280  0.359363
2 -1.312495  1.366280  0.359363
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN

### Pandas - Iteration
Iterating over pandas objects is a fundamental task in data manipulation, and the behavior of iteration depends on the type of object you're dealing with.<br>
The iteration behavior in pandas varies between Series and DataFrame objects −

* **Series:** Iterating over a Series object yields the values directly, making it similar to an array-like structure.
* **DataFrame:** Iterating over a DataFrame follows a dictionary-like convention, where the iteration produces the column labels (i.e., the keys).

#### Iterating Through Rows in a DataFrame
* **items():** to iterate over the (key,value) pairs
* **iterrows():** iterate over the rows as (index,series) pairs
* **itertuples():** iterate over the rows as namedtuples

In [540]:
df = pd.DataFrame(np.random.randn(4,3),columns=['col1','col2','col3'])
df

       col1      col2      col3
0  0.364338 -0.844526 -1.336464
1  0.585708 -0.813423 -1.604466
2  0.092848  0.942739  2.295462
3 -0.702516 -0.712875  0.827537

In [542]:
for key,value in df.items():
    print("-"*20)
    print(key)
    print(value)

--------------------
col1
0    0.364338
1    0.585708
2    0.092848
3   -0.702516
Name: col1, dtype: float64
--------------------
col2
0   -0.844526
1   -0.813423
2    0.942739
3   -0.712875
Name: col2, dtype: float64
--------------------
col3
0   -1.336464
1   -1.604466
2    2.295462
3    0.827537
Name: col3, dtype: float64

In [544]:
for row_index,row in df.iterrows():
    print("-"*20)
    print(row_index)
    print(row)

--------------------
0
col1    0.364338
col2   -0.844526
col3   -1.336464
Name: 0, dtype: float64
--------------------
1
col1    0.585708
col2   -0.813423
col3   -1.604466
Name: 1, dtype: float64
--------------------
2
col1    0.092848
col2    0.942739
col3    2.295462
Name: 2, dtype: float64
--------------------
3
col1   -0.702516
col2   -0.712875
col3    0.827537
Name: 3, dtype: float64

**Note:** Because iterrows() iterate over the rows, it doesn't preserve the data type across the row.

#### Iterate Over DataFrame as Namedtuples
The **itertuples()** method will return an iterator yielding a named tuple for each row in the DataFrame. <br>
The first element of the tuple will be the row’s corresponding index value, while the remaining values are the row values. <br>
This method is generally **faster than iterrows()** and **preserves the data types** of the row elements.

In [393]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, col1=0.28162830008006906, col2=1.1542217874394454, col3=1.065156469624245)
Pandas(Index=1, col1=1.0521689630997162, col2=-0.5806230592791356, col3=-1.022708699255227)
Pandas(Index=2, col1=2.7478910231913978, col2=-0.44577512112550033, col3=1.8381874187540546)
Pandas(Index=3, col1=0.04664886030457421, col2=-1.04441586806785, col3=0.9830442534922061)

#### Iterating Through DataFrame Columns
When you iterate over a DataFrame, it will simply returns the column names.

In [396]:
for col in df:
   print(col)

col1
col2
col3

### Pandas - Concatenation
Concatenation in Pandas refers to the process of joining two or more Pandas objects (like DataFrames or Series) along a specified axis.<br>
This operation is very useful when you need to merge data from different sources or datasets.

The primary tool for this operation is **pd.concat()** function, which can useful for Series, DataFrame objects, whether you're combining rows or columns. <br>
Concatenation in Pandas involves combining multiple DataFrame or Series objects either row-wise or column-wise.

**Syntax** <br>
pandas.concat(objs, *, axis=0, join='outer', ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, sort=False, copy=None)

**objs:** This is a sequence or mapping of Series, DataFrame, or Panel objects.

**axis: {0, 1, ...}, default 0.** This is the axis to concatenate along.

**join: {"inner", "outer"}, default "outer".** How to handle indexes on other axis(es). Outer for union and inner for intersection.

**ignore_index: boolean, default False.** If True, do not use the index values on the concatenation axis. The resulting axis will be labeled 0, ..., n - 1.

**keys:** Used to create a hierarchical index along the concatenation axis.

**levels:** Specific levels to use for the MultiIndex in the result.

**names:** Names for the levels in the resulting hierarchical index.

**verify_integrity:** If True, checks for duplicate entries in the new axis and raises an error if duplicates are found.

**sort:** When combining DataFrames with unaligned columns, this parameter ensures the columns are sorted.

**copy:** default None. If False, do not copy data unnecessarily.

In [550]:
one = pd.DataFrame({
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5'],
   'Marks_scored':[98,90,87,69,78]},
   index=[1,2,3,4,5])
one

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78

In [552]:
two = pd.DataFrame({
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5'],
   'Marks_scored':[89,80,79,97,88]},
   index=[1,2,3,4,5])
two

    Name subject_id  Marks_scored
1  Billy       sub2            89
2  Brian       sub4            80
3   Bran       sub3            79
4  Bryce       sub6            97
5  Betty       sub5            88

In [554]:
result = pd.concat([one, two])
result

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

In [406]:
pd.concat([one,two],keys=['x','y'])

       Name subject_id  Marks_scored
x 1    Alex       sub1            98
  2     Amy       sub2            90
  3   Allen       sub4            87
  4   Alice       sub6            69
  5  Ayoung       sub5            78
y 1   Billy       sub2            89
  2   Brian       sub4            80
  3    Bran       sub3            79
  4   Bryce       sub6            97
  5   Betty       sub5            88

In [556]:
pd.concat([one,two],keys=['x','y'],ignore_index=True)

     Name subject_id  Marks_scored
0    Alex       sub1            98
1     Amy       sub2            90
2   Allen       sub4            87
3   Alice       sub6            69
4  Ayoung       sub5            78
5   Billy       sub2            89
6   Brian       sub4            80
7    Bran       sub3            79
8   Bryce       sub6            97
9   Betty       sub5            88

In [558]:
pd.concat([one,two],axis=1)

     Name subject_id  Marks_scored   Name subject_id  Marks_scored
1    Alex       sub1            98  Billy       sub2            89
2     Amy       sub2            90  Brian       sub4            80
3   Allen       sub4            87   Bran       sub3            79
4   Alice       sub6            69  Bryce       sub6            97
5  Ayoung       sub5            78  Betty       sub5            88

#### Row or Column Wise Function Application

In [560]:
df = pd.DataFrame(np.random.randn(5, 3), columns=['col1', 'col2', 'col3'])
df

       col1      col2      col3
0  0.371535 -0.800135 -2.153702
1 -0.937621  1.319954 -0.659161
2 -0.544051  0.718796 -0.402093
3  0.073685 -0.099282  1.567929
4  1.433639 -0.406037  0.425273

In [562]:
np.mean

In [564]:
result = df.apply(np.mean)
result

col1    0.079437
col2    0.146659
col3   -0.244351
dtype: float64

In [417]:
result = df.apply(np.mean, axis=1)
result

0    0.347999
1    0.190566
2   -0.044586
3    0.089040
4    0.281905
dtype: float64

#### Applying a Lambda Function

In [568]:
result = df.apply(lambda x: x.max() - x.min())
result

col1    2.371260
col2    2.120089
col3    3.721631
dtype: float64

### Pandas - Merging/Joining

Pandas has full-featured, high performance in-memory join operations. Very similar to relational databases like SQL.

Pandas provides a single function, merge, as the entry point for all standard database join operations between DataFrame objects −

**Syntax**<br>
> pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None,left_index=False, right_index=False, sort=True)
>
**left −** A DataFrame object.

**right −** Another DataFrame object.

**on −** Columns (names) to join on. Must be found in both the left and right DataFrame objects.

**left_on −** Columns from the left DataFrame to use as keys. Can either be column names or arrays with length equal to the length of the DataFrame.

**right_on −** Columns from the right DataFrame to use as keys. Can either be column names or arrays with length equal to the length of the DataFrame.

**left_index −** If True, use the index (row labels) from the left DataFrame as its join key(s). In case of a DataFrame with a MultiIndex (hierarchical), the number of levels must match the number of join keys from the right DataFrame.

**right_index −** Same usage as left_index for the right DataFrame.

**how −** One of 'left', 'right', 'outer', 'inner'. Defaults to inner. Each method has been described below.

**sort −** Sort the result DataFrame by the join keys in lexicographical order. Defaults to True, setting to False will improve the performance substantially in many cases.

In [571]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
left

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5

In [573]:
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})
right

   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [575]:
pd.merge(left,right,on='id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [432]:
pd.merge(left,right,on=['id','subject_id'])

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

#### Merge Using 'how' Argument
The how argument to merge specifies how to determine which keys are to be included in the resulting table. <br>
If a key combination does not appear in either the left or the right tables, the values in the joined table will be NA.

Here is a summary of the how options and their SQL equivalent names −

**Merge Method	SQL Equivalent	     Description**<br>
left	        **LEFT OUTER JOIN**	     Use keys from left object<br>
right	        **RIGHT OUTER JOIN**	 Use keys from right object<br>
outer	        **FULL OUTER JOIN**	     Use union of keys<br>
inner	        **INNER JOIN**	         Use intersection of keys<br>

In [577]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
left

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5

In [579]:
right = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})
right

   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [442]:
pd.merge(left, right, on='subject_id', how='left')

   id_x  Name_x subject_id  id_y Name_y
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     3   Allen       sub4   2.0  Brian
3     4   Alice       sub6   4.0  Bryce
4     5  Ayoung       sub5   5.0  Betty

In [444]:
pd.merge(left, right, on='subject_id', how='right')

   id_x  Name_x subject_id  id_y Name_y
0   2.0     Amy       sub2     1  Billy
1   3.0   Allen       sub4     2  Brian
2   NaN     NaN       sub3     3   Bran
3   4.0   Alice       sub6     4  Bryce
4   5.0  Ayoung       sub5     5  Betty

In [446]:
pd.merge(left, right, how='outer', on='subject_id')

   id_x  Name_x subject_id  id_y Name_y
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   NaN     NaN       sub3   3.0   Bran
3   3.0   Allen       sub4   2.0  Brian
4   5.0  Ayoung       sub5   5.0  Betty
5   4.0   Alice       sub6   4.0  Bryce

In [448]:
pd.merge(left, right, on='subject_id', how='inner')

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     3   Allen       sub4     2  Brian
2     4   Alice       sub6     4  Bryce
3     5  Ayoung       sub5     5  Betty

### Pandas - Missing Data
Missing data is always a problem in real life scenarios. <br>
Particularly in areas like machine learning and data analysis. <br>
Missing values can significantly impact the accuracy of models and analyses, making it crucial to address them properly.

Consider a scenario where an online survey is conducted for a product. Many a times, people do not share all the information related to them, they might skip some questions, leading to incomplete data.<br>
For example, some might share their experience with the product but not how long they have been using it, or vice versa. Missing data is a frequent occurrence in such real-time scenarios, and handling it effectively is essential.

#### Representing Missing Data in Pandas
Pandas uses different sentinel values to represent missing data (NA or NaN), depending on the data type.

**numpy.nan:** Used for NumPy data types. When missing values are introduced in an integer or boolean array, the array is upcast to np.float64 or object, as NaN is a floating-point value.

**NaT:** Used for missing dates and times in np.datetime64, np.timedelta64, and PeriodDtype. NaT stands for "Not a Time".

**< NA >:** A more flexible missing value representation for StringDtype, Int64Dtype, Float64Dtype, BooleanDtype, and ArrowDtype. This type preserves the original data type when missing values are introduced.

In [581]:
ser1 = pd.Series([1, 2], dtype=np.int64).reindex([0, 1, 2])
ser2 = pd.Series([1, 2], dtype=np.dtype("datetime64[ns]")).reindex([0, 1, 2])
ser3 = pd.Series([1, 2], dtype="Int64").reindex([0, 1, 2])

df = pd.DataFrame({'NumPy':ser1, 'Dates':ser2, 'Others':ser3} )
df

   NumPy                         Dates  Others
0    1.0 1970-01-01 00:00:00.000000001       1
1    2.0 1970-01-01 00:00:00.000000002       2
2    NaN                           NaT    <NA>

#### Checking for Missing Values
Pandas provides the **isna()** and **notna()** functions to detect missing values, which work across different data types. <br>
These functions return a Boolean Series indicating the presence of missing values.

In [583]:
df.isna()

   NumPy  Dates  Others
0  False  False   False
1  False  False   False
2   True   True    True

In [458]:
df.notna()

   NumPy  Dates  Others
0   True   True    True
1   True   True    True
2  False  False   False

#### Replacing/Filling Missing Data
Pandas provides several methods to handle missing data. <br>
One common approach is to replace missing values with a specific value using the fillna() method.

In [461]:
df.fillna(0)

   NumPy                          Dates  Others
0    1.0  1970-01-01 00:00:00.000000001       1
1    2.0  1970-01-01 00:00:00.000000002       2
2    0.0                              0       0

#### Drop Missing Values
If you want to simply exclude the missing values instead of replacing then, then use the **dropna()** function for dropping missing values.

In [ ]:
df

In [466]:
df.dropna()

   NumPy                         Dates  Others
0    1.0 1970-01-01 00:00:00.000000001       1
1    2.0 1970-01-01 00:00:00.000000002       2

In [468]:
df

   NumPy                         Dates  Others
0    1.0 1970-01-01 00:00:00.000000001       1
1    2.0 1970-01-01 00:00:00.000000002       2
2    NaN                           NaT    <NA>

#### Removing Duplicates
The **drop_duplicates()** method is used to remove duplicate rows from the DataFrame. <br>
By default, it considers all columns and keeps the first occurrence of each duplicated row, while removing the rest.

In [471]:
df = pd.DataFrame({
'Name': ['Rahul', 'Raj', 'Rahul', 'Karthik', 'Arya', 'Karthik'],
'Date_of_Birth': ['01 December 2017', '14 April 2018', '01 December 2017', '14 July 2000', '26 May 2000', '14 July 2000'],
'City': ['Hyderabad', 'Chennai', 'Kolkata', 'Hyderabad', 'Chennai', 'Hyderabad']})
df

      Name     Date_of_Birth       City
0    Rahul  01 December 2017  Hyderabad
1      Raj     14 April 2018    Chennai
2    Rahul  01 December 2017    Kolkata
3  Karthik      14 July 2000  Hyderabad
4     Arya       26 May 2000    Chennai
5  Karthik      14 July 2000  Hyderabad

In [473]:
df.drop_duplicates()

      Name     Date_of_Birth       City
0    Rahul  01 December 2017  Hyderabad
1      Raj     14 April 2018    Chennai
2    Rahul  01 December 2017    Kolkata
3  Karthik      14 July 2000  Hyderabad
4     Arya       26 May 2000    Chennai

### Pandas - GroupBy
Any groupby operation involves one of the following operations on the original object. <br>
They are −
* Splitting the Object
* Applying a function
* Combining the results

In many situations, we split the data into sets and we apply some functionality on each subset. <br>
In the apply functionality, we can perform the following operations −

* **Aggregation −** computing a summary statistic
* **Transformation −** perform some group-specific operation
* **Filtration −** discarding the data with some condition

In [585]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [587]:
df.groupby('Team')

In [589]:
for k, v in df.groupby('Team'):
    print("-"*20)
    print(k)
    print(v)

--------------------
Devils
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673
--------------------
Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788
--------------------
Riders
      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690
--------------------
Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804
--------------------
kings
    Team  Rank  Year  Points
5  kings     4  2015     812

In [591]:
for k, v in df.groupby(['Team','Year']):
    print("-"*20)
    print(k)
    print(v)

--------------------
('Devils', 2014)
     Team  Rank  Year  Points
2  Devils     2  2014     863
--------------------
('Devils', 2015)
     Team  Rank  Year  Points
3  Devils     3  2015     673
--------------------
('Kings', 2014)
    Team  Rank  Year  Points
4  Kings     3  2014     741
--------------------
('Kings', 2016)
    Team  Rank  Year  Points
6  Kings     1  2016     756
--------------------
('Kings', 2017)
    Team  Rank  Year  Points
7  Kings     1  2017     788
--------------------
('Riders', 2014)
     Team  Rank  Year  Points
0  Riders     1  2014     876
--------------------
('Riders', 2015)
     Team  Rank  Year  Points
1  Riders     2  2015     789
--------------------
('Riders', 2016)
     Team  Rank  Year  Points
8  Riders     2  2016     694
--------------------
('Riders', 2017)
      Team  Rank  Year  Points
11  Riders     2  2017     690
--------------------
('Royals', 2014)
     Team  Rank  Year  Points
9  Royals     4  2014     701
--------------------
('Royals', 2015)
      Team  Rank  Year  Points
10  Royals     1  2015     804
--------------------
('kings', 2015)
    Team  Rank  Year  Points
5  kings     4  2015     812

**Aggregations**<br>
An aggregated function returns a single aggregated value for each group. <br>
Once the group by object is created, several aggregation operations can be performed on the grouped data.

In [488]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [496]:
for k, v in df.groupby('Team'):
    print("-"*20)
    print(k)
    print(v)

--------------------
Devils
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673
--------------------
Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788
--------------------
Riders
      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690
--------------------
Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804
--------------------
kings
    Team  Rank  Year  Points
5  kings     4  2015     812

In [494]:
df.groupby('Team')['Points'].agg(np.mean)

C:\Users\jlakh\AppData\Local\Temp\ipykernel_14332\2422766249.py:1: FutureWarning: The provided callable <function mean at 0x00000198F452E660> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  df.groupby('Team')['Points'].agg(np.mean)

Team
Devils    768.000000
Kings     761.666667
Riders    762.250000
Royals    752.500000
kings     812.000000
Name: Points, dtype: float64